# FeedThroughLugsIsOccupied Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..FeedThroughLugsIsOccupied Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
The feed through lugs is in use by circuit [Element].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FeedThroughLugsIsOccupied { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FeedThroughLugsIsOccupied As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FeedThroughLugsIsOccupied {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace